/**Задача 3
 *  Игра «Как стать миллионером».
 *  Подумайте, как можно реализовать подобный сценарий с использованием массивов и объектов.
 *  Помните, что для каждого вопроса нужно прописать: вопрос, 4 варианта ответа, правильный ответ (который будем сравнивать с тем,
 *  что ввел пользователь, сумма которую выиграл пользователь).
 *  Определите минимум 5 вопросов. Вопросы с вариантами ответов вы можете придумать самостоятельно, а можете воспользоваться поиском.
 **/
let millionaire = [
    {
        question: "Що таке програмування?",
        choose: {
            a: "ремонт комп'ютера",
            b: "процес написання програми для комп'ютера",
            c: "дизайн зображень",
            d: "нічого з запропонованого"
        },
        answer: "b",
        score: 500,
    },
    {
        question: "З чого складається комп'ютер?",
        choose: {
            a: "з інтернету",
            b: "з апаратної частини і програмного забезпечення",
            c: "з клавіатури і принтера",
            d: "з клавіатури, мишки і монітора"
        },
        answer: "b",
        score: 1000,
    },
    {
        question: "Що розуміється під апаратною частиною комп'ютера?",
        choose: {
            a: "усі частини комп'ютера",
            b: "програма, яку комп'ютер виконує",
            c: "операційна система встановлена на комп'ютері",
            d: "нічого з запропонованого"
        },
        answer: "a",
        score: 2000,
    },
    {
        question: "Що представляє собою програмне забезпечення?",
        choose: {
            a: "усі частини комп'ютера",
            b: "програма, яку комп'ютер виконує",
            c: "мишка та клавіатура комп'ютера",
            d: "нічого з запропонованого"
        },
        answer: "b",
        score: 3000,
    },
    {
        question: "Мови асемблери представляють перехідний тип між:",
        choose: {
            a: "машинними мовами і мовами нижчого рівня",
            b: "мовами нижчого рівня і мовами вищого рівня",
            c: "машинними мовами і мовами вищого рівня",
            d: "нічого з запропонованого"
        },
        answer: "c",
        score: 5000,
    },
];

let scoreOfGame = 0;
for (const element of millionaire) {
    let allShoose = "";
    for (key in element.choose) {
        allShoose += key + ": " + element.choose[key] + "\n";
    }
    let userAnswer = prompt("Питання:  " + element.question + "\nВведіть правильну відповідь a, b, c чи d\n" + allShoose);
    if (userAnswer === element.answer) {
        scoreOfGame = element.score;
        if (!confirm("Вірно! \nВаш рахунок складає: " + scoreOfGame + "\nБажаете продовжити гру")){
            break;
        }
    } else {
        scoreOfGame = 0;
        alert("Ви програли! \nВаш рахунок складає: " + scoreOfGame);
        break;
    }


}

if (scoreOfGame === 2000) {
    alert("Приміть вітання ви виграли гру." + "\nВаш рахунок складає: " + scoreOfGame);
}
