/**Задача 3
 Игра «Как стать миллионером».
 Подумайте, как можно реализовать подобный сценарий с использованием массивов и объектов.
 Помните, что для каждого вопроса нужно прописать: вопрос, 4 варианта ответа, правильный ответ (который будем сравнивать с тем,
 что ввел пользователь, сумма которую выиграл пользователь).
 Определите минимум 5 вопросов. Вопросы с вариантами ответов вы можете придумать самостоятельно, а можете воспользоваться поиском.
 **/

// var Question = new Object();
// Question.text = "What is the capital of Thailand?";
// Question.answers = ['Bangcock', 'Bangdick', 'Bandtits', 'Bangpussy'];
// Question.right = "Bangcock"